print('''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/[TomekK]
*******************************************************************************
''')

"""upper() =  تابع هر ورودی کاربر رو ب کلمات بزرگ تبدیل میکنه تا با استرینگی ک ما داخل مقایسه شرطمون گذاشتیم یکی باشه و شرط غلط نشه."""
"""strip() = استریپ فاصله های اول واخر استرینگ رو پاک میکنه """

print("Welcome to the Treasure Island.")
print("Your mission is to find the treasure.")

move_1 = input("You're at a cross road. Type 'left' or 'right': ").strip().upper()

if move_1 == "RIGHT":
    print("Game Over")
elif move_1 == "LEFT":
    print("You come to a lake.")
    print("There is an island in the middle of the lake.")

    move_2 = input("Type 'wait' or 'swim': ").strip().upper()

    if move_2 == "SWIM":
        print("Game Over")
    elif move_2 == "WAIT":
        move_3 = input("Choose a door: yellow, blue or red: ").strip().upper()

        if move_3 == "RED":
            print("Game Over")
        elif move_3 == "BLUE":
            print("Game Over")
        elif move_3 == "YELLOW":
            print("You Win!")
        else:
            print("Invalid door!")
    else:
        print("Invalid choice!")
else:
    print("Invalid choice!")
               


